Documents/КСУ_ФормальнаяВыплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>КСУ_ФормальнаяВыплата</Name>
			<BasedOn>
				<xr:Item>Document.ИА_ЗаказНаПриобретение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИА_СредстваНаФондах</xr:Item>
				<xr:Item>AccumulationRegister.ИА_СредстваВРезервеНаФондах</xr:Item>
				<xr:Item>InformationRegister.ИА_ИсторияСтатусовЗВС</xr:Item>
				<xr:Item>AccumulationRegister.ИА_ЗаказыНаПриобретение</xr:Item>
				<xr:Item>AccumulationRegister.ИА_ДоходыБудущихПериодов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЗаказов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияДочерняя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>иа_Фонды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фонд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ИА_ИсточникиСпецДохода</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>иа_ЗаказыНаПриобретение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗП</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Одобрено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УжеВыплатили</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФондСтатья</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваВРезервеНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваВРезервеНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСУ_ОперацииПоФондам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/ИА_ГруппыКомпаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ГруппыКомпаний</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДочерниеОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/КСУ_ФормальнаяВыплата/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	Элементы.ФондыПодразделение.Видимость = ИспПодразделения;
	Элементы.ЗаказыНаПриобретениеЗППодразделение.Видимость = ИспПодразделения;
	
	Если Элементы.Найти("ФормаПровести") <> Неопределено тогда
		Элементы.ФормаПровести.Видимость = не объект.Проведен;
	КонецЕсли;
	Если Элементы.Найти("ФормаОтменаПроведения") <> Неопределено тогда
		Элементы.ФормаОтменаПроведения.Видимость = объект.Проведен;
	КонецЕсли;
	Если Элементы.Найти("ФормаЗаписать") <> Неопределено тогда
		Элементы.ФормаЗаписать.Видимость = не объект.Проведен;
	КонецЕсли;
	
	Элементы.УстановитьПометкуУдаления.Видимость = не (объект.Проведен или объект.Ссылка.Пустая());
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПоОрг = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	ИспПодразделения = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	ИспользуютсяГруппыКомпаний = Справочники.ИА_ГруппыКомпаний.ПолучитьПризнакИспользованияГруппКомпаний();
	
	
	Если объект.Ссылка.Пустая() Тогда
		объект.Дата = ТекущаяДата();
		объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		
		для каждого стр из объект.иа_ЗаказыНаПриобретение цикл
			д = ДанныеПоЗаказу(стр.ЗП, объект.Дата );
			ЗаполнитьЗначенияСвойств(стр, д);
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.ОрганизацияДочерняя.Видимость = ПоОрг и ИспользуютсяГруппыКомпаний;
	
	Если ИспользуютсяГруппыКомпаний тогда
		Элементы.Организация.Заголовок = "Головная";	
		Элементы.Организация.ТолькоПросмотр = истина;	
		Элементы.Организация.ОтображениеПодсказки=ОтображениеПодсказки.Нет;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьЭлементов();
	ОбновитьДоступностьСписанияСФондов();
	ОбновитьОбщийИтог();
	ВидимостьГолОрг();
	
	ОбновитьДоступностьПоУтверждению();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьСписанияСФондов()
	Дост = ИА_ПраваС.ЗначениеПраваТекПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.ИА_ПраваПользователей.ВыплатаНапрямуюСФондов"))
	или ИА_ПраваС.ЗначениеПраваТекПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.ИА_ПраваПользователей.ФП_ПолныеПрава"));
	Элементы.Фонды.Доступность = Дост;
	Элементы.Фонды.КоманднаяПанель.Доступность = Дост;
	Элементы.ДекорацияНетправ.Видимость = не Дост;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьВидимостьЭлементов();
	
	ОбновитьДоступностьПоУтверждению();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.иа_Фонды.итог("Сумма") + ТекущийОбъект.иа_ЗаказыНаПриобретение.итог("Сумма");
	
	Если ТекущийОбъект.СуммаДокумента = 0 и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		Сообщить("Нельзя проводить документ с нулевыми суммами!");
		отказ = истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИА_ЗаказыНаПриобретениеЗПНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
		
	ПарамПодб = Новый Структура("НаДату,Организация", Объект.Дата, Объект.Организация);		
	ОпОп = новый ОписаниеОповещения("КомандаПодобратьЗаказЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ИА_ФП_ПодборЗаказаУпр", ПарамПодб,,,,, ОпОп);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодобратьЗаказЗавершение(рез, ДополнительныеПараметры) Экспорт		
	Если рез<>Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Элементы.ИА_ЗаказыНаПриобретение.ТекущиеДанные, рез);
		ОбновитьОбщийИтог();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Спецдоход(Команда)
	
	НастройкиФП = ПолучитьНастройкиФП();
	Парам = новый Структура("Док,Организация,НастройкиФП,ДатаОстатков",Объект.Ссылка, Объект.Организация,НастройкиФП, объект.Дата);
	
	ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ФормаПодбораДБПУпр", Парам,,,,, Новый ОписаниеОповещения("КомандаПодобратьЗавершение", ЭтотОбъект, Парам), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодобратьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	рез = Результат;
	
	Если ТипЗнч(рез) = тип("Массив") Тогда
		Для каждого стр из рез Цикл
			Новстр = Объект.ИА_Фонды.Добавить();
			
			Новстр.ВидДохода = стр.ВидДохода;
			Новстр.ПодразделениеДохода = стр.Подразделение;
			Новстр.Источник = стр.Источник;
			
			Новстр.Сумма = стр.СуммаБезнал;
			
			Новстр.Подразделение = ДополнительныеПараметры.НастройкиФП.ПодразделениеДоходовБП;
			Новстр.Фонд = ДополнительныеПараметры.НастройкиФП.ФондДоходовБП; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиФП()
	Возврат Новый Структура("ПодразделениеДоходовБП, ФондДоходовБП,РазделятьНалИБезнал", Константы.ИА_ФП_ПодразделениеДоходовБП.Получить(), Константы.ИА_ФП_ФондДоходовБП.Получить(),Константы.ИА_ФП_РазделятьНалИБезнал.Получить());
КонецФункции

&НаСервере
Процедура ПодборФондовЗаказовНаСервере(СтруктураПараметров, ЭтоФонды)
	Если ЭтоФонды Тогда
		ТЗ = Объект.ИА_Фонды.Выгрузить();
	Иначе	
		ТЗ = Объект.ИА_ЗаказыНаПриобретение.Выгрузить();
	КонецЕсли; 
	СтруктураПараметров = Новый Структура;
	АдресХранилища      = ПоместитьВоВременноеХранилище(ТЗ, Новый УникальныйИдентификатор);
	СтруктураПараметров.Вставить("ЭтоТолстыйКлиент" ,	Ложь);
	СтруктураПараметров.Вставить("АдресХранилища" ,		АдресХранилища);
	СтруктураПараметров.Вставить("Организация" ,		Объект.Организация);
	СтруктураПараметров.Вставить("ЭтоНал",				Константы.ИА_ФП_РазделятьНалИБезнал.Получить());
	СтруктураПараметров.Вставить("ДатаДок",				Объект.Дата);
	
	
	СтруктураНастройкиРеквизитов = ИА_ФП_ПовторИсп.ПолучитьЗначениеКонстанты_ФП_НастройкиРеквизитов(); 
	ВалютаДок = Неопределено;
	ВалютаУпр = Неопределено;
	Попытка
		ВалютаДок = Объект[СтруктураНастройкиРеквизитов.ИмяРеквизитаВалютаДокумента];
		ВалютаУпр = Константы[СтруктураНастройкиРеквизитов.ИмяРеквизитаВалютаУПР].Получить();
	Исключение
	КонецПопытки;
	СтруктураПараметров.Вставить("ВалютаДок", ВалютаДок);
	СтруктураПараметров.Вставить("ВалютаУпр", ВалютаУпр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗаказов(Команда)  
	Если ПоОрг и объект.Организация.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо указать организацию!");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Неопределено; 
	ПодборФондовЗаказовНаСервере(СтруктураПараметров, Ложь);
	ОткрытьФорму("ОбщаяФорма.ИА_ПодборЗаявокНаДенСредств", СтруктураПараметров, ЭтаФорма); //,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПодбораНаСервере(Парам)			
	ТЗ = ПолучитьИзВременногоХранилища(Парам.АдресХранилища);
	Если НЕ ТЗ = Неопределено Тогда
		Если ТЗ.Количество() > 0  Тогда
			Если Парам.ЭтоФонды Тогда
				Объект.ИА_Фонды.Загрузить(ТЗ);
			Иначе
				объект.иа_ЗаказыНаПриобретение.Очистить();
				Для каждого стр из ТЗ цикл
					Новстр = объект.иа_ЗаказыНаПриобретение.Добавить();
					ЗаполнитьЗначенияСвойств(Новстр, стр);
					д = ДанныеПоЗаказу(стр.ЗП, объект.Дата);
					ЗаполнитьЗначенияСвойств(Новстр, д);					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПоЗаказу(Заказ, ДатаДок)			
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналПриход КАК Одобрено,
	|	ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналРасход КАК УжеВыплатили
	|ИЗ
	|	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, &ДатаКонца, , ЗП = &ЗП) КАК ИА_СредстваВРезервеНаФондахОбороты";
	Запрос.УстановитьПараметр("ЗП", Заказ);
	Запрос.УстановитьПараметр("ДатаКонца", ?(ДатаДок = дата(1,1,1), ТекущаяДата(), ДатаДок - 1));
	Выборка = запрос.Выполнить().Выбрать();
	Рез = новый Структура("Одобрено, УжеВыплатили, ФондСтатья, НомерСтрока", 0, 0, "", "");
	Рез.ФондСтатья = строка(Заказ.Фонд) + ?( Заказ.Статья.Пустая(),"", " (" + Заказ.Статья + ")" );
	Рез.НомерСтрока = "№" + УбратьНули(Заказ.Номер); 
	Если выборка.Следующий() тогда
		ЗаполнитьЗначенияСвойств(рез, Выборка);
	КонецЕсли;
	
	Возврат рез;
КонецФункции

&НаСервереБезКонтекста
Функция УбратьНули(номер)
	рез = номер; 
	Пока Лев(рез, 1) = "0" Цикл 
		рез = Прав(рез, СтрДлина(рез) - 1);
	КонецЦикла;
	Возврат рез;
КонецФункции

&НаКлиенте
Процедура ОбработкаПодбораЗаказовФондов(Парам) Экспорт	
	ОбработкаПодбораНаСервере(Парам); 
	ОбновитьОбщийИтог();
КонецПроцедуры

&НаКлиенте
Процедура ПодборФондов(Команда)
	Если ПоОрг и объект.Организация.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо указать организацию!");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Неопределено; 
	ПодборФондовЗаказовНаСервере(СтруктураПараметров, Истина);
	ОткрытьФорму("ОбщаяФорма.ИА_ПодборСтатейЗатратИПодразделений", СтруктураПараметров, ЭтаФорма); //,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ОбновитьОбщийИтог();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбщийИтог()
	ИА_ОбщийИтог = Объект.ИА_ЗаказыНаПриобретение.Итог("Сумма") + Объект.ИА_Фонды.Итог("Сумма");
	Элементы.ДекорацияИА_ОбщийИтог.Заголовок = "Итого: " + Формат(ИА_ОбщийИтог,"ЧЦ=15; ЧДЦ=2; ЧН=0")+ ИА_ФП_Клиент.ПолучитьУточнениеПоВалюте(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыНаПриобретениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если поле = Элементы.ЗаказыНаПриобретениеСумма Тогда
		возврат;
	КонецЕсли;
	тд = Элементы.ЗаказыНаПриобретение.ТекущиеДанные;
	ПоказатьЗначение(, тд.ЗП);
КонецПроцедуры

&НаКлиенте
Процедура ФондыСуммаПриИзменении(Элемент)
	тд = Элементы.Фонды.ТекущиеДанные;
	если тд= Неопределено Тогда
		возврат;
	КонецЕсли;
	
	РОстаток = ПолучитьОстатокФонда(тд.Фонд, тд.Подразделение, объект.Дата, объект.Организация);
	Если РОстаток<тд.Сумма тогда
		тд.Сумма = РОстаток;
		Сообщить("Превышен остаток по фонду!");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОстатокФонда(Фонд, Подразделение, Дата, Организация)
	
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(ИА_СредстваНаФондахОстатки.СуммаБезналОстаток, 0) - ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток, 0) КАК Остаток
	|ИЗ
	|	РегистрНакопления.ИА_СредстваНаФондах.Остатки(
	|			&НаДату,
	|			Организация = &Организация
	|				И Подразделение = &Подразделение
	|				И Фонд = &Фонд) КАК ИА_СредстваНаФондахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(&НаДату, ) КАК ИА_СредстваВРезервеНаФондахОстатки
	|		ПО ИА_СредстваНаФондахОстатки.Организация = ИА_СредстваВРезервеНаФондахОстатки.Организация
	|			И ИА_СредстваНаФондахОстатки.Подразделение = ИА_СредстваВРезервеНаФондахОстатки.Подразделение
	|			И ИА_СредстваНаФондахОстатки.Фонд = ИА_СредстваВРезервеНаФондахОстатки.Фонд";
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Фонд", Фонд);
	
	РОстаток = 0;
	Выборка = запрос.Выполнить().Выбрать();
	
	Если выборка.Следующий() тогда
		РОстаток = выборка.Остаток;
	КонецЕсли;
	
	Возврат РОстаток;
КонецФункции

&НаКлиенте
Процедура ЗаказыНаПриобретениеСуммаПриИзменении(Элемент)
	тд = Элементы.ЗаказыНаПриобретение.ТекущиеДанные;
	если тд= Неопределено Тогда
		возврат;
	КонецЕсли;
	
	РОстаток = ПолучитьОстатокЗаказа(тд.ЗП, объект.Дата);
	Если РОстаток<тд.Сумма тогда
		тд.Сумма = РОстаток;
		Сообщить("Превышен остаток по заказу!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОстатокЗаказа(ЗП, Дата)
	
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток, 0) КАК Остаток
	|ИЗ
	|	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(&НаДату, ЗП = &ЗП) КАК ИА_СредстваВРезервеНаФондахОстатки";
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("ЗП", ЗП);
	
	РОстаток = 0;
	Выборка = запрос.Выполнить().Выбрать();
	
	Если выборка.Следующий() тогда
		РОстаток = выборка.Остаток;
	КонецЕсли;
	
	Возврат РОстаток;
КонецФункции

&НаКлиенте
Процедура ЗаказыНаПриобретениеПриИзменении(Элемент)
	ОбновитьОбщийИтог();
КонецПроцедуры

&НаКлиенте
Процедура ФондыПриИзменении(Элемент)
	ОбновитьОбщийИтог();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияДочерняяПриИзменении(Элемент)
	ГоловнаяОрганизация = ИА_ФП.ПолучитьГоловнуюОрганизацию(Объект.ОрганизацияДочерняя);
	Объект.Организация = ГоловнаяОрганизация;
	ВидимостьГолОрг();
	
	объект.иа_ЗаказыНаПриобретение.Очистить();
	объект.иа_Фонды.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьГолОрг()
	Элементы.Организация.Видимость = ПоОрг и (Объект.Организация <> Объект.ОрганизацияДочерняя или Объект.Организация.Пустая());
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьПоУтверждению()
	
	Элементы.ГруппаЦ.ТолькоПросмотр = объект.Проведен;
	Элементы.ЗаказыНаПриобретение.КоманднаяПанель.Доступность = не объект.Проведен;
	Элементы.Фонды.КоманднаяПанель.Доступность = не объект.Проведен;
	
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	объект.иа_ЗаказыНаПриобретение.Очистить();
	объект.иа_Фонды.Очистить();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	если  ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение и ПоОрг и объект.Организация.Пустая() тогда
		Сообщить("Заполните поле Организация");
		Отказ= Истина;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Режимзаписи = РежимЗаписиДокумента.Проведение и объект.Дата > КонецДня(ТекущаяДата()) ТОгда		
		ПоказатьПредупреждение(,"Формальну выплату можно сохранять как черновик с датой будущего периода. Но утверждать можно не позднее текущей даты (сегодняшней даты). Измените дату и повторите операцию, если вы действительно решили утвердить Формальну выплату.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры
